import 'package:clreader/book/book_info.dart';

BookInfo testBookInfo = BookInfo(
  urlCover:
      "http://www.newxue.com/d/file/p/0f27c47cf491fdbd961f776ea8549fcc.jpg",
  name: "围城",
  author: "钱钟书",
  introduction:
      "《围城》是钱钟书唯一的一部长篇小说（另一部小说《百合心》未创作结束即被遗失，从此作者便再没有续写），开始创作于1944年，1946年完稿，1947年由上海晨光出版公司印制发行。该书是钱钟书“锱铢积累”而成的，小说从他熟悉的时代，熟悉的地方，熟悉的社会阶层取材。但组成故事的人物和情节全属虚构。尽管某几个角色稍有真人的影子，事情都子虚乌有；某些情节略具真实，人物却全是捏造的。而男主角方鸿渐则是取材于两个亲戚：一个志大才疏，常满腹牢骚；一个狂妄自大，爱自吹自唱。两人都读过《围城》，但是谁也没自认为方鸿渐，因为他们从未有方鸿渐的经历。故事主要写抗战初期知识分子的群相。《围城》是中国现代文学史上一部风格独特的讽刺小说。被誉为“新儒林外史”。",
  srcId: "1",
);
